app/controllers/api/v1/companies_controller.rb

      def index
        @companies = Company.all
---
SELECT "companies".* FROM "companies"

      def create
        @company = Company.new(company_params)

        respond_to do |format|
          if @company.save
---
INSERT INTO "companies" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hfsssssssss   xx xx"], ["address", "hfsssfdsf32 x xx"], ["created_at", "2017-10-25 14:11:31.355672"], ["updated_at", "2017-10-25 14:11:31.355672"]]

      def update
        respond_to do |format|
          if @company.update(company_params)
---
UPDATE "companies" SET "address" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["address", "11111111111111"], ["updated_at", "2017-10-25 14:12:04.135605"], ["id", 14]]

      def destroy
        @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 14]]

        def set_company
          @company = Company.find_by_id(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]