app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "x223 232323"], ["created_at", "2017-10-25 04:41:12.569798"], ["updated_at", "2017-10-25 04:41:12.569798"]]

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "x223 232        323"], ["updated_at", "2017-10-25 05:07:13.339893"], ["id", 5]]

  def destroy
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]