app/controllers/users_controller.rb

UPDATE "users" SET "fullname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fullname", "Client 01111"], ["updated_at", "2017-10-25 13:51:48.306717"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)